const members = [
    "강명성", "강지수", "김동낙", "김명진",
    "김지민", "김지화", "김진욱", "김태완",
    "김현호", "박기둥", "박상우", "박지운",
    "박지원", "배승현", "서수정", "오수민",
    "유승연", "이동진", "이병곤", "이선문",
    "이재관", "이지원", "이학임", "장다예",
    "장익제", "전세환", "전웅섭", "전준수",
    "정승연", "주예슬", "최소영", "황현태"
]

const randomMates = []

const mates = {}

function randomMembers() {
    while(randomMates.length < 32){
        let mate = members[Math.floor(Math.random() * members.length)]
        if(randomMates.indexOf(mate) == -1){
            randomMates.push(mate)
        }
    }
    var i = 0;
    while(i < randomMates.length){
        const arrayInObject = new Array(randomMates[i], randomMates[i+1]);
        arrayInObject.sort();
        mates[i] = arrayInObject;
        i = i + 2;
    }
    console.log(mates)
}

randomMembers()

const mates1 = [
    '김동낙', '오수민',
    '강명성', '장익제',
    '주예슬', '이학임',
    '이병곤', '이재관',
    '정승연', '이선문',
    '서수정', '강지수',
    '전세환', '김태완',
    '황현태', '유승연',
    '김지민', '김진욱',
    '박지운', '박기둥',
    '박지원', '배승현',
    '박상우', '김지화',
    '이동진', '전웅섭',
    '최소영', '김명진',
    '전준수', '이지원',
    '장다예', '김현호']

const mates2 = [
    '전웅섭', '배승현',
    '전세환', '장다예',
    '황현태', '오수민',
    '김태완', '박지원',
    '이재관', '강지수',
    '이학임', '주예슬',
    '김지화', '김명진',
    '박상우', '김진욱',
    '서수정', '박기둥',
    '이지원', '강명성',
    '이동진', '이선문',
    '박지운', '정승연',
    '장익제', '유승연',
    '이병곤', '김동낙',
    '김지민', '김현호',
    '최소영', '전준수']


const week3 = {
    0: ['김진욱', '배승현'],
    2: ['김현호', '이선문'],
    4: ['박상우', '주예슬'],
    6: ['유승연', '장익제'],
    8: ['김지민', '이재관'],
    10: ['장다예', '전웅섭'],
    12: ['강명성', '정승연'],
    14: ['김태완', '이병곤'],
    16: ['김지화', '박지운'],
    18: ['김명진', '이지원'],
    20: ['강지수', '전준수'],
    22: ['박지원', '황현태'],
    24: ['이동진', '최소영'],
    26: ['오수민', '전세환'],
    28: ['김동낙', '박기둥'],
    30: ['서수정', '이학임']
}

